Repository: jfuentescasillas/MarvelVIPER
Catalog: MarvelVIPER/*.lproj/Localizable.strings
Languages: fr

# charactersTabBarItem
source: Characters
fr: Personnages

# favoritesTabBarItem
source: Favorites
fr: Favoris

# marvelCharactersVCTitle
source: Marvel Characters
fr: Personnages Marvel

# charsResetButtonTitle
source: Reset
fr: Effacer

# charsSearchBarPlaceholder
source: Search for a character...
fr: Rechercher un personnage...

# charsSearchBarInvalidTextInputTitle
source: Invalid text input
fr: Texte Invalide

# charsSearchBarInvalidTextInputMessage
source: Only alphanumeric characters are allowed in the search bar. Please try another search with valid characters
fr: Seuls les caractères alphanumériques sont autorisés dans la barre de recherche. Veuillez essayer une autre recherche avec des caractères valides

# emptySearchResultsLabel
source: There were no results for the character you requested. Please try with another name.
fr: Il n'y a pas de résultats pour le personnage que vous avez demandé. Veuillez essayer avec un autre nom.

# reloadCharsButtonTitle
source: Reload Characters
fr: Recharger Personnages

# alertControllerInvalidTextInputTitle
source: Invalid Text Input
fr: Texte Invalide

# alertControllerInvalidTextInputMsg
source: Your search can only contain numbers, letters and/or blank spaces, please try again with a valid format.
fr: Votre recherche ne peut contenir que des chiffres, des lettres et/ou des espaces vides, veuillez réessayer avec un format valide.

# retryBtnTitle
source: Retry
fr: Réessayer

# cancelBtnTitle
source: Cancel
fr: Annuler

# noInternetTitle
source: No internet connection
fr: Sans connection internet

# noInternetMsg
source: Your device is not connected to the internet, please try again later.
fr: Pas de connexion internet. Veuillez réessayer plus tard.

# badRequestMsg
source: There was a problem while sending the request to the server to get a list of characters. Please try again later.
fr: Il y a eu un problème en demandant la liste de personnages. Veuillez réessayer plus tard.

# alertControllerBadRequestTitle
source: Bad Request
fr: Mauvaise Requête

# alertControllerBadRequestMsg
source: There were problems requesting data to server.
fr: Il y a eu des problèmes pour demander des données au serveur.

# badResponseMsg
source: There was a problem while receiving data from the server. Please try again later.
fr: Il y a eu un problème pour recevoir des données du serveur. Veuillez réessayer plus tard.

# alertControllerBadResponseTitle
source: Bad Response
fr: Mauvaise Réponse

# alertControllerBadResponseMsg
source: There were problems receiving data from the server.
fr: Il y a eu des problèmes pour recevoir des données du serveur.

# characterSavedSuccessfullyMsg
source: The character was successfully saved in your list of Favorite Characters!
fr: Le personnage a été enregistrée avec succès dans ta liste de personnages favoris!

# characterCannotBeSavedTitle
source: Oops!
fr: Oh là-là!

# characterCannotBeSavedMsg
source: This character is already in your list of Favorite Characters! Therefore, they will not be saved again in the list.
fr: Ce personnage se trouve déjà dans ta liste de favoris! Donc, il n'y sera pas réenregistrée.

# favoriteCharactersVCTitle
source: Favorite Marvel Characters
fr: Personnages Marvel Favoris

# favCharsResetButtonTitle
source: Reset
fr: Rétablir

# characterSavedCommentsDefaultValue
source: Write here your observations about this character...
fr: Écris ici tes observations sur ce personnage...

# emptyFavoriteListTxt
source: This list of favorite characters is still empty. Add some from the 'Characters' tab!
fr: Cette liste de personnages favoris est encore vide! Ajoutes-en dès le tab 'Personnages'!

# noFavoriteCharsFoundTitle
source: No Marvel Characters Found!
fr: Aucun personnage trouvé!

# noFavoriteCharsFoundMsg
source: Your favorite list of characters does not have any character with the requested query, please try again with another name.
fr: Ta liste de personnages Marvel préférés n'a aucun personnage avec le nom demandé. Réessaie avec un autre nom, s'il te plaît.
